In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import plotly.express as px

In [2]:
table_1 = pd.read_csv("../data/raw/df_final_demo.txt")
table_2 = pd.read_csv("../data/raw/df_final_experiment_clients.txt")
df_3 = pd.read_csv("../data/raw/df_final_web_data_pt_1.txt")
df_4 = pd.read_csv("../data/raw/df_final_web_data_pt_2.txt")

In [3]:
table_1.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [4]:
table_2.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [5]:
df_3.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [6]:
df_4.head ()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [7]:
#Data shape
table_1.shape
table_2.shape
df_3.shape
df_4.shape

(412264, 5)

In [8]:
#null values
table_1.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [9]:
#join df_1 & df_2 table into table_3
table_3 = pd.concat([df_3, df_4], axis=0)
display(table_3)

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [10]:
# date and time parsing in table_3
table_3['date_time'] = pd.to_datetime(table_3['date_time'], format='%Y-%m-%d %H:%M:%S', errors='coerce')

In [11]:
# Extract year, date, and time from 'date_time' column
table_3['year'] = table_3['date_time'].dt.year
table_3['date'] = pd.to_datetime(table_3['date_time'].dt.date, format='%Y-%m-%d', errors='coerce')
table_3['time'] = pd.to_datetime(table_3['date_time'].dt.time.astype(str), format='%H:%M:%S', errors='coerce').dt.time

In [12]:
# Display the updated table with the new columns
display(table_3.head())

,client_id,visitor_id,visit_id,process_step,date_time,year,date,time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,2017,2017-04-17,15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,2017,2017-04-17,15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,2017,2017-04-17,15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,2017,2017-04-17,15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,2017,2017-04-17,15:18:04

In [13]:
#data types
display(table_3.dtypes)

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
year                     int64
date            datetime64[ns]
time                    object
dtype: object

In [14]:
table_2.isna().sum ()

client_id        0
Variation    20109
dtype: int64

In [15]:
table_3.isna().sum ()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
year            0
date            0
time            0
dtype: int64

In [16]:
# Display the first few rows of the DataFrame including the 'gender' column
table_1 = table_1[['gendr']]
print(table_1.head())

  gendr
0     U
1     U
2     U
3     M
4     F

In [17]:
table_1['gendr']

0        U
1        U
2        U
3        M
4        F
        ..
70604    U
70605    M
70606    F
70607    M
70608    F
Name: gendr, Length: 70609, dtype: object

In [18]:
#unique values in gender column
table_1['gendr'].unique ()

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [19]:
#Chcking unique values in table 2 - variation
table_2['Variation'].unique ()

array(['Test', 'Control', nan], dtype=object)

In [20]:
table_3['process_step'].unique ()

array(['step_3', 'step_2', 'step_1', 'start', 'confirm'], dtype=object)

In [23]:
# Display all column names in table_1
print(table_1.columns)

Index(['gendr'], dtype='object')

In [22]:
#Demographic Analysis
#Who are the primary clients using this online process?

# Analyzing age distribution with the correct column name
sns.histplot(table_1['clnt_age'], kde=True)
plt.title('Age Distribution of Clients')
plt.xlabel('clnt_age')
plt.ylabel('Number of Clients')
plt.show()

KeyError: 'client_age'

In [ ]:
#Are the primary clients younger or older, new or long-standing?

# Analyzing tenure (assuming there's a column related to client tenure in one of the tables)
sns.histplot(df_3['tenure'], kde=True)
plt.title('Client Tenure Distribution')
plt.xlabel('Tenure (in months/years)')
plt.ylabel('Number of Clients')
plt.show()

In [ ]:
# Analyzing client type
client_type_counts = table_2['client_type'].value_counts()
px.pie(client_type_counts, names=client_type_counts.index, values=client_type_counts.values, title="Client Type Distribution").show()